api/app/controllers/comments_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 6 LIMIT 1
---
  def set_post
    @post = Post.find(params[:post_id])