api/app/controllers/comments_controller.rb

SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 8 ORDER BY `comments`.`created_at` DESC
---
  def index
    comments =  @post.comments.order(created_at: :desc)

INSERT INTO `comments` (`user_id`, `post_id`, `content`, `created_at`, `updated_at`) VALUES (4, 5, 'コメントです', '2020-12-08 11:02:01.198697', '2020-12-08 11:02:01.198697')
---
  def create
    comment = Comment.new(
      comment_params.merge(post_id: @post.id)
    )
    if comment.save

UPDATE `comments` SET `comments`.`content` = 'コメントですkkkkk', `comments`.`updated_at` = '2020-12-08 11:02:09.750404' WHERE `comments`.`id` = 1
---
  def update
    if @comment = Comment.update(comment_params)

DELETE FROM `comments` WHERE `comments`.`id` = 5
---
  def destroy
    @comment.destroy

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 5 LIMIT 1
---
  def set_post
    @post = Post.find(params[:post_id])

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 4 LIMIT 1
---
  def set_comment
    @comment = Comment.find(params[:id])