api/app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC
---
  def index
    posts = Post.all.order(created_at: :desc)

SELECT SUM(`posts`.`number`) AS sum_number, `posts`.`size` AS posts_size FROM `posts` WHERE `posts`.`name` = 'カテゴリー２' AND `posts`.`size` IS NOT NULL GROUP BY `posts`.`size`
SELECT SUM(`posts`.`number`) AS sum_number, `posts`.`feed` AS posts_feed FROM `posts` WHERE `posts`.`name` = 'たい' AND `posts`.`feed` != '' GROUP BY `posts`.`feed`
SELECT SUM(`posts`.`number`) AS sum_number, MONTH(date) AS month_date FROM `posts` WHERE `posts`.`name` = 'カテゴリー２' AND `posts`.`date` IS NOT NULL GROUP BY MONTH(date)
SELECT SUM(`posts`.`number`) AS sum_number, HOUR(time) AS hour_time FROM `posts` WHERE `posts`.`name` = 'たい' AND `posts`.`time` IS NOT NULL GROUP BY HOUR(time)
---
  def show
    same_name_post = Post.where(name: @post.name)
    size_data = same_name_post.where.not(size: nil).group(:size).sum(:number)
    feed_data = same_name_post.where.not(feed: '').group(:feed).sum(:number)
    date_data = same_name_post.where.not(date: nil).group("MONTH(date)").sum(:number)
    time_data = same_name_post.where.not(time: nil).group("HOUR(time)").sum(:number)

INSERT INTO `posts` (`name`, `number`, `feed`, `weather`, `memo`, `status`, `created_at`, `updated_at`, `user_id`, `latitude`, `longitude`) VALUES ('タイ', 1, '', '', '', '', '2020-12-10 02:06:52.834494', '2020-12-10 02:06:52.834494', 4, 35.0, 135.0)
---
  def create
    post = Post.new(post_params)
    if post.save