api/app/controllers/users_controller.rb

  def show
    user = User.find_by(uid: params[:id])
    user_data = user.posts.group(:name).sum(:number)
---
SELECT `users`.* FROM `users` WHERE `users`.`uid` = 'knxEYDpNFDgo7ArIwsMPa0uesMl2' LIMIT 1
SELECT `posts`.* FROM `posts` INNER JOIN `likes` ON `posts`.`id` = `likes`.`post_id` WHERE `likes`.`user_id` = 8