api/app/controllers/users_controller.rb

  def index
    users = User.all.order(created_at: :desc)
---
SELECT `users`.* FROM `users` ORDER BY `users`.`created_at` DESC

  def update
    if @user.update(user_params)
---
UPDATE `users` SET `users`.`introduction` = 'jjjjjsssdddd', `users`.`updated_at` = '2020-12-08 04:14:36.389049' WHERE `users`.`id` = 8

  def show
    user_data = @user.posts.group(:name).sum(:number)
---
SELECT `posts`.* FROM `posts` INNER JOIN `likes` ON `posts`.`id` = `likes`.`post_id` WHERE `likes`.`user_id` = 4 ORDER BY `posts`.`created_at` DESC
SELECT SUM(`posts`.`number`) AS sum_number, `posts`.`name` AS posts_name FROM `posts` WHERE `posts`.`user_id` = 8 GROUP BY `posts`.`name`

  def set_user
    @user = User.find_by(uid: params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`uid` = 'hrOovztHR8ag10tBlHeoWqyQ30n1' LIMIT 1